.model small
.stack 100h
.data
msg db ' ', '$'                 ; змінна, Для виводу данних
num db '012'                    ; змінна-число з якого починаємо відлік
.code
main PROC
    mov ax, SEG @data           ; завантажуємо сегмент даних
    mov ds, ax                  ; завантажуємо сегмент даних у регістр ds

    mov dx, offset msg          ; готуємо адресу msg для виведення
    mov ah, 9                   ; готуємо функцію виведення рядка

    mov bl, [num]               ; переносимо перший символ з num у реєстр bl

    mov cl, [num + 1]           ; переносимо другий символ з num у реєстр cl

    mov bh, [num + 2]           ; переносимо третій символ з num у реєстр bh


hundreds:                       ; ініціалізуємо цикл, що відповідає за сотні
    tens:                       ; ініціалізуємо цикл, що відповідає за десятки
        units:                  ; ініціалізуємо цикл, що відповідає за одиниці

            mov [msg], bl       ; перезаписуємо значення сотнів у msg
            mov [msg+1], cl     ; перезаписуємо значення десятків у msg
            mov [msg+2], bh     ; перезаписуємо значення одиниць у msg
            mov [msg+3], ' '    ; додаємо пробіл у msg
            mov [msg+4], '$'    ; додаємо кінець стрічки у msg

            int 21h             ; виводимо стрічку у консоль

            dec bh              ; зменшуємо кількість одиниць

            cmp bh, 2fh         ; якщо вийшли за межі цифр
            jne units           ; виходимо з циклу

        mov bh, 39h             ; встановлюємо значення одниць 39h (9)

        dec cl                  ; зменшуємо значення десятків

        cmp cl, 2fh             ; якщо вийшли за межі цифр
        jne tens                ; зупиняємо цикл

    mov cl, 39h                 ; встановлюємо значення десятків 39h (9)

    dec bl                      ; зменшуємо кількість сотень

    cmp bl, 2fh                 ; якщо вийшли за межі цифр
    jne hundreds                ; зупиняємо цикл


mov ax, 4c00h       ; завершення програми
int 21h             ; викликаємо переривання для завершення програми
main ENDP
END main